In [4]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4,5,6],'col2':[444,555,666,444,777,999],'col3':['abc','def','ghi','xyz',"jkl","mno"]})

In [5]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz
4     5   777  jkl
5     6   999  mno

In [6]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz
4     5   777  jkl

In [13]:
df["col2"].unique()

array([444, 555, 666, 777, 999])

In [31]:
df["col2"].value_counts(sort=True,ascending=True)

555    1
666    1
777    1
999    1
444    2
Name: col2, dtype: int64

In [65]:
# df["length"]=df["col2"].apply(len)      

df['Length'] = df['col3'].apply(len)
df

   col1  col2    col3  Length  Length2  min len3
0     1   444     abc       3        3     False
1     2   555     def       3        3     False
2     3   666     ghi       3        3     False
3     4   444  Heello       6        3      True
4     5   777     jkl       3        3     False
5     6   999     mno       3        3     False

In [66]:
df.loc[:,'Length2'] = df['col3'].apply(len)
df

   col1  col2    col3  Length  Length2  min len3
0     1   444     abc       3        3     False
1     2   555     def       3        3     False
2     3   666     ghi       3        3     False
3     4   444  Heello       6        6      True
4     5   777     jkl       3        3     False
5     6   999     mno       3        3     False

In [54]:
df["col3"].apply(lambda x:x*2)

0    abcabc
1    defdef
2    ghighi
3    xyzxyz
4    jkljkl
5    mnomno
Name: col3, dtype: object

In [67]:
def func(x):
    return len(x)>3

df["min len3"]=df["col3"].apply(func)
df

   col1  col2    col3  Length  Length2  min len3
0     1   444     abc       3        3     False
1     2   555     def       3        3     False
2     3   666     ghi       3        3     False
3     4   444  Heello       6        6      True
4     5   777     jkl       3        3     False
5     6   999     mno       3        3     False

In [64]:
df.loc[3,"col3"]="Heello"

In [69]:
df.sort_values("col2")

   col1  col2    col3  Length  Length2  min len3
0     1   444     abc       3        3     False
3     4   444  Heello       6        6      True
1     2   555     def       3        3     False
2     3   666     ghi       3        3     False
4     5   777     jkl       3        3     False
5     6   999     mno       3        3     False

In [71]:
df["Length"].nunique()

2

In [73]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [75]:
df.columns

Index(['col1', 'col2', 'col3', 'Length', 'Length2', 'min len3'], dtype='object')

In [77]:
df.isnull()

    col1   col2   col3  Length  Length2  min len3
0  False  False  False   False    False     False
1  False  False  False   False    False     False
2  False  False  False   False    False     False
3  False  False  False   False    False     False
4  False  False  False   False    False     False
5  False  False  False   False    False     False

In [81]:
df["col3"].isin(["jkl"])

0    False
1    False
2    False
3    False
4     True
5    False
Name: col3, dtype: bool